<?php

//2.Определить сложность следующих алгоритмов. Сколько произойдет итераций?

//1)

$n = 10000;
$array[]= [];

for ($i = 0; $i < $n; $i++) {        //O(n) = 10000
  for ($j = 1; $j < $n; $j *= 2) {  //O(logn) = 13
     $array[$i][$j]= true;
} }
//Ответ: O(n), итераций 10000

//2)

$n = 10000;
$array[] = [];

for ($i = 0; $i < $n; $i += 2) { //O(n) = 5000
  for ($j = $i; $j < $n; $j++) { //O(n) = 10000
   $array[$i][$j]= true;
} }
//Ответ: O(n^2), итераций 100 000 000

//3)

$n = 10000;
$array[] = [];
foo($n);

function foo($n)
{
    $n = 10;
    while ($n > 0) {  //O(n) = 10
        for ($j = sqrt($n); $j < $n; $j++) { //O (n)
            $n--;
            foo($n);    //O(n^2) = 100
        }
    }
}
//Ответ: O(n^2)*O(n)*O(n) = O(n^4), итераций 10 000